app/Controllers/LoginController.php

    public function processLogin()
    {
        $model = new AdminModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $admin = $model->where('username', $username)
            ->where('password', $password)
            ->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'Nanashi'
AND `password` = 'a'
 LIMIT 1