app/Models/PeminjamanModel.php

    public function getPeminjamanWithDetails()
    {
        return $this->db->table('tbtransaksi t')
            ->select('t.*, a.nama, b.judulbuku')
            ->join('tbanggota a', 't.idanggota = a.idanggota')
            ->join('tbbuku b', 't.idbuku = b.idbuku')
            ->get()
            ->getResultArray();
---
SELECT `t`.*, `a`.`nama`, `b`.`judulbuku`
FROM `tbtransaksi` `t`
JOIN `tbanggota` `a` ON `t`.`idanggota` = `a`.`idanggota`
JOIN `tbbuku` `b` ON `t`.`idbuku` = `b`.`idbuku`